README.org
#+STARTUP: overview

* Table of contents :TOC_3:
- [[#how-to-use][How to use]]
  - [[#tangle][Tangle.]]
  - [[#make-sure-relevant-files-are-checking-into-version-control][Make sure relevant files are checking into version control]]
  - [[#apply-the-config-with-dry-activate--test--switch][Apply the config with ~dry-activate~ / ~test~ / ~switch~.]]
- [[#nix-environment-for-this-config][Nix environment for this config]]
- [[#root-config][Root config]]
  - [[#utility-functions][Utility functions]]
- [[#user-emma][user ~emma~]]
  - [[#enable-nixos-flakes][Enable nixos flakes]]
    - [[#is-this-really-the-right-place-for-this][is this really the right place for this?]]
  - [[#i3-config][I3 config]]
    - [[#dissribute-i3-conf-to-other-sections-where-it-makes-sense-to-have-it][dissribute i3 conf to other sections where it makes sense to have it]]
  - [[#basic-terminal-and-shell][Basic terminal and shell]]
  - [[#ssh][ssh]]
  - [[#git][git]]
  - [[#emacs][Emacs]]
    - [[#moving-around][Moving around]]
    - [[#relative-line-numbering][Relative line numbering]]
    - [[#insert-emojis-and-unicode][Insert emojis and unicode]]
    - [[#custom-unicodeemoji-insertion][Custom unicode/emoji insertion]]
    - [[#spell-checking-not-active-wasnt-configured-successfully][Spell checking (Not active, wasn't configured successfully)]]
    - [[#general-org-mode][General =org-mode=]]
    - [[#zettelkasten-method-with-org-roam-v2][Zettelkasten-method with =org-roam v2=.]]
    - [[#read-pdfs-and-epubs-with-pdftools-novel-and-anotate-them-with-noter][Read pdf's and epub's with =pdftools=, =nov.el= and anotate them with =noter=]]
    - [[#terminal-emulator][Terminal emulator]]
    - [[#python-language-server][Python language server]]
  - [[#direnv][direnv]]
    - [[#move-emacs-for-direnv-config-here][Move emacs for direnv config here]]
  - [[#misc-programs-specific-to-emma][Misc programs specific to emma]]
    - [[#firefox][firefox]]
    - [[#gimp][Gimp]]
    - [[#feh][Feh]]
    - [[#tldr][Tldr]]
    - [[#zip-and-unzip][zip and unzip]]
    - [[#spectre-cli][spectre-cli]]
    - [[#customized-vim][customized vim]]
  - [[#globally-installed-programming-language][Globally installed programming language]]
  - [[#flashcards-setup][Flashcards setup]]
    - [[#org-drill][=org-drill=]]
    - [[#webwork-flashcard][=webwork-flashcard=]]
  - [[#backups-with-meganz][Backups with mega.nz]]
- [[#user-foo][user ~foo~]]
  - [[#spectre][Spectre]]
  - [[#git-1][Git]]
  - [[#mullvad-browser][Mullvad browser]]
- [[#desktop-environment][Desktop environment]]
- [[#networking][Networking]]
  -  [[#managing-networkmanager-connections-delete-connections-see-passwords][Managing =NetworkManager= connections (delete connections, see passwords)]]
  - [[#vpn][VPN]]
- [[#localizationkeymaptimezone][Localization/keymap/timezone]]
- [[#other-packages][Other packages]]
  - [[#vim][Vim]]
  - [[#teamviewer][Teamviewer]]
  - [[#mathematica][Mathematica]]
- [[#machine-specific-configuration][Machine specific configuration]]
    - [[#high-res-screen][High-res screen]]
    - [[#screen-brightness][Screen brightness]]
    - [[#sound][Sound]]
    - [[#touchpad][Touchpad]]
    - [[#boot][Boot]]
    - [[#result-of-nixos-generate-config][Result of ~nixos-generate-config~.]]
- [[#misc][Misc]]
  - [[#use-x-server][Use X server:]]
  - [[#ssh-1][SSH]]
  - [[#state-version][State version]]
- [[#global-todos][Global TODOS]]
  - [[#find-a-relliable-way-to-override-default-doom-settings-for-packages][Find a relliable way to override default doom settings for packages]]
  - [[#should-i3-be-configured-in-nix-instead-of-in-a-separate-config-file][Should =i3= be configured in nix instead of in a separate config file?]]
  - [[#setup-home-folder-syncing-with-mega][Setup home folder syncing with Mega]]
  - [[#add-tons-of-math-related-unicode-to-emojify][Add tons of math-related unicode to emojify]]
  - [[#c--style-shortcut-for-inserting-emojis][~C-*~ style shortcut for inserting emojis]]
  - [[#sometimes-only-the-first-time-when-opening-a-hyperlink-in-emacs-they-are-opened-as-two-tabs-in-ff--one-tab-in-chrome][Sometimes (only the first time?) when opening a hyperlink in emacs they are opened as two tabs in FF + one tab in Chrome.]]
  - [[#pomodoro-timer-in-emacs][Pomodoro timer in emacs]]
  - [[#move-doom-emacsinitel-into-the-literate-config][Move ~./doom-emacs/init.el~ into the literate config.]]
  - [[#proj-c-move-all-of-the-contents-of-emma-into-the-literate-config][PROJ [#C] Move all of the contents of ./emma/ into the literate config.]]
  - [[#configure-doom-emacs-so-that-everything-doesnt-have-to-be-rebuilt-everytime][Configure doom-emacs so that everything doesn't have to be rebuilt everytime]]

* How to use

** Tangle.
#+begin_src elisp :noweb yes
(org-babel-tangle)
#+end_src

#+RESULTS:
| ./doom-emacs/packages.el | ./doom-emacs/config.el | utils.nix | flake.nix | ./.envrc | ./dev-flake/flake.nix |

** Make sure relevant files are checking into version control

When running a nix flake unstaged files are ignored (see[[https://github.com/NixOS/nix/pull/6858][ this issue]]) which can result in some confusing error messages about files not existing. Make sure all the relevant files are (temporarily) staged.

** Apply the config with ~dry-activate~ / ~test~ / ~switch~.

~nixos-rebuild <dry-activate | test | switch> --flake .~

* Nix environment for this config
To tangle this config and interactively run some of the non shell and elsip code-blocks we want to setup a nix environment.

We use a nix flake for the environment. If we depend on some program to run code blocks in this config the dependencies can be added here.

#+begin_src nix :noweb yes :tangle ./dev-flake/flake.nix
{
  description = "Flake to use when working on the literate config";

  inputs.flake-utils.url = "github:numtide/flake-utils";

  outputs = { self, nixpkgs, flake-utils }:
    flake-utils.lib.eachDefaultSystem
      (system:
        let pkgs = nixpkgs.legacyPackages.${system}; in
        {
          devShells.default = pkgs.mkShell {
            packages = [
            ];
          };
        }
      );
}
#+end_src

and also enable direv:

#+begin_src envrc :tangle ./.envrc
use flake ./dev-flake
#+end_src

Direnv expects the flake to be named ~flake.nix~ which conflicts with the name of our system configuration flake. Hence putting this flake in a subdirectory. We could use a non standard name but it would require us to make some changes in the flake itself annd that's a hassle I won't bother dealing with.

* Root config

This config is =flake.nix= compatible which is the root of the config.
Credit to https://youtu.be/watch?v=mJbQ--iBc1U for helping me migrate my original config to =flake.nix=

#+begin_src nix :noweb yes :tangle flake.nix
{
  description = "emmabastas system configuration";

  inputs = {
    nixpkgs.url = "github:nixos/nixpkgs/nixos-23.05";
    home-manager = {
      url = "github:nix-community/home-manager/release-23.05";
      inputs.nixpkgs.follows = "nixpkgs";
    };
    <<inputs-emacs>>
  };

  outputs = { self, nixpkgs, home-manager, nix-doom-emacs, ... }:
  let
    system = "x86_64-linux";

    pkgs = import nixpkgs {
      inherit system;
      config = { allowUnfree = true; };
    };

    lib = nixpkgs.lib;

    utils = (import ./utils.nix) lib;

  in {
    nixosConfigurations = {
      acomputer = lib.nixosSystem {
        inherit system;

        modules = [
          home-manager.nixosModules.home-manager {
            home-manager = {
              useGlobalPkgs = true;
              useUserPackages = true;
              <<users-emma>>
              <<users-foo>>
            };
          }
          ({ config, pkgs, ... }: (utils.recursiveMerge [
            {
              imports = [ utils.hardwareConfig ];

              users.users.emma = {
                isNormalUser = true;
                extraGroups = [ "wheel" ];
              };

              users.users.foo = {
                isNormalUser = true;
                extraGroups = [ "wheel" ];
              };

              system.stateVersion = <<state-version>>;
            }
            <<system-wide-boot>>
            <<system-wide-networking-1>>
            <<system-wide-networking-2>>
            <<system-wide-networking-vpn>>
            <<system-wide-localization>>
            <<system-wide-machine-specific>>
            <<system-wide-high-res-1>>
            <<system-wide-high-res-2>>
            <<system-wide-desktop-environment>>
            <<system-wide-vim>>
            <<system-wide-brightnessctl>>
            <<system-wide-mathematica>>
            <<system-wide-teamviewer>>
            <<system-wide-sound>>
            <<system-wide-touchpad>>
            <<system-wide-misc-x-server>>
            <<system-wide-misc-ssh>>
            <<system-wide-misc-allow-unfree>>
          ]))
        ];
      };
    };
  };
}
#+end_src

** Utility functions

#+name: utility-functions
#+begin_src nix :noweb yes :tangle utils.nix
lib: {
  allSame = with lib; values:
    if tail values == []
      then true
    else if head values == head (tail values)
      then allSame (tail values)
    else false;

  join = with lib; sep: values:
    if values == []
      then ""
    else if tail values == []
      then head values
    else "${head values}${sep}${join sep (tail values)}";

  # based off https://stackoverflow.com/a/54505212
  recursiveMerge = with lib; attrList:
    let f = attrPath:
      zipAttrsWith (n: values:
        if tail values == []
          then head values
        else if all isList values
          then unique (concatLists values)
        else if all isAttrs values
          then f (attrPath ++ [n]) values
        else if allSame values
          then head values
        else abort "Values in ${join "." attrPath} can't be merged."
      );
    in f [] attrList;

  hardwareConfig = (
    <<hardware-config>>
  );
}
#+end_src

* user ~emma~
Here we can configure programs for the main user account

#+name: users-emma
#+begin_src nix :noweb yes
users.emma =
let
  shellScript = cmd: {
    text = ''
      #!/bin/sh
      ${cmd}
    '';
    executable = true;
  };

  applicationScript = cmd: shellScript ''
    (${cmd} &)
    kill $(expr $PPID - 1)
  '';
in
lib.mkMerge [
  nix-doom-emacs.hmModule
  ({ pkgs, ... }: utils.recursiveMerge [
    {
      home.stateVersion = <<state-version>>;
    }
    <<users-emma-emacs-1>>
    <<users-emma-emacs-2>>
    <<users-emma-emacs-3>>
    <<users-emma-emacs-zettelkasten>>
    <<users-emma-emacs-nov-el>>
    <<users-emma-emacs-python>>
    <<users-emma-mega-cmd>>
    <<users-emma-mullvad>>
    <<users-emma-gimp>>
    <<users-emma-feh>>
    <<users-emma-tldr>>
    <<users-emma-zip-unzip>>
    <<users-emma-webwork-flashcard>>
    <<users-emma-global-pls>>
    <<users-emma-spectre-cli>>
    <<users-emma-firefox>>
    <<users-emma-vim>>
    <<users-emma-direnv>>
    <<users-emma-st>>
    <<users-emma-nerdfonts>>
    <<users-emma-ssh>>
    <<users-emma-bash>>
    <<users-emma-git>>
    <<users-emma-i3>>
    <<users-emma-nix-flakes>>
    {
      programs.doom-emacs = {
        extraConfig = ''
          <<users-emma-emacs-extra-config-zettelkasten>>
          <<users-emma-emacs-extra-config-nov-el>>
        '';
      };
    }
  ])
];
#+end_src

** Enable nixos flakes
We need this to use nix flakes??

#+name: users-emma-nix-flakes
#+begin_src nix
{
  home.file.".config/nix/nix.conf".text = ''experimental-features = nix-command flakes'';
}
#+end_src
*** TODO is this really the right place for this?
** I3 config
#+name: users-emma-i3
#+begin_src nix
{
  home.file.".config/i3/config".source = ./i3.conf;
}
#+end_src
*** TODO dissribute i3 conf to other sections where it makes sense to have it
** Basic terminal and shell

We use our own st package for the terminal

#+name: users-emma-st
#+begin_src nix
{
  home.packages = [ (pkgs.callPackage ./st {}) ];
}
#+end_src

The st package is configured to use =FiraCode=

#+name: users-emma-nerdfonts
#+begin_src nix
{
  home.packages = [ (pkgs.nerdfonts.override { fonts = [ "FiraCode" ]; }) ];
  fonts.fontconfig.enable = true;
}
#+end_src

This is our shell configuration

#+name: users-emma-bash
#+begin_src nix :noweb yes
{
  programs.bash = {
    enable = true;
    bashrcExtra = ''
      export PATH=$HOME/bin:$PATH
      <<users-emma-direnv-bashrc-extra>>
    '';
  };
}
#+end_src

** ssh
#+name: users-emma-ssh
#+begin_src nix
{
  programs.ssh.enable = true;
}
#+end_src
** git
#+name: users-emma-git
#+begin_src nix
{
  programs.git = {
    enable = true;
    userName = "emmabastas";
    userEmail = "emma.bastas@protonmail.com";
    extraConfig = {
      core.editor = "${(pkgs.callPackage ./vim-cli.nix {}).out}/bin/vim";
      init.defaultBranch = "main";
    };
    ignores = [ "*.swp" ];
  };
}
#+end_src
** Emacs
We're using [[https://github.com/doomemacs/doomemacs][doom-emacs]]:

#+name: inputs-emacs
#+begin_src nix
nix-doom-emacs.url = "github:nix-community/nix-doom-emacs";
#+end_src

There are three main ~.el~ files used for configuring doom-emacs:
1) ~config.el~ all "normal" configuration goes here
2) ~init.el~ for enabling doom-emacs module
3) ~packages.el~ for installing packages that aren't part of any doom-emacs module

~config.el~ and ~packages.el~ are tangled from this document whereas ~init.el~ is edited directly. They all end up in ~./doom-emacs/~.


For [[https://github.com/nix-community/nix-doom-emacs/pull/303][caching reasons]] nix-doom-emacs provides two directories for the config files, one for ~config.el~ and one for ~packages.el~. Doom-emacs has to be rebuild everytime ~packages.el~ is changed.
~init.el~ goes in both of these directories (??).

So what happens is we make two derivations containing files in ~./doom-emacs/~ then thell doom-emacs to find the configuration files in these derivations
(This snippet of code is based off: https://github.com/nix-community/nix-doom-emacs/blob/9cbb1c3aa7b957bd2f88215c08c3cb3f55f8e2bb/checks.nix#L46-L64)

#+name: users-emma-emacs-1
#+begin_src nix :noweb yes
{
  programs.doom-emacs = {
    doomPrivateDir = pkgs.linkFarm "doom-config" [
      { name = "config.el"; path = ./doom-emacs/config.el; }
      { name = "init.el";   path = ./doom-emacs/init.el; }
      # Should *not* fail because we're building our straight environment
      # using the doomPackageDir, not the doomPrivateDir.
      {
        name = "packages.el";
        path = pkgs.writeText "packages.el" "(package! not-a-valid-package)";
      }
    ];
    doomPackageDir = pkgs.linkFarm "doom-config" [
      # straight needs a (possibly empty) `config.el` file to build
      { name = "config.el";   path = pkgs.emptyFile; }
      { name = "init.el";     path = ./doom-emacs/init.el; }
      { name = "packages.el"; path = ./doom-emacs/packages.el; }
    ];
  };
}
#+end_src

Lastly we run the emacs server on login:

#+name: users-emma-emacs-2
#+begin_src nix
{
  programs.doom-emacs.enable = true;
  services.emacs.enable = true;
}
#+end_src

Also we add some two convenience script for starting and debugging emacs

#+name: users-emma-emacs-3
#+begin_src nix
{
  home.file = {
    "bin/emacs" = applicationScript "emacsclient -cn $@";
    "bin/emacs-debug" = shellScript "emacs-28.1 -l /home/emma/etc-nixos/doom-emacs/config.el $@";
  };
}
#+end_src

