README.org
*** Moving around
When moving around we want to move by visual lines instead of actual lines. I.e. if we have this

#+begin_quote

                    + -- Location of the cursor marked with <*>
                    v
1| Here's a normal <l>ine of text              |
2| Some really looooooooong text that won't f- | <--- Edge of the window
.| it in the window and is therefore wrapped.  |
3| Here's another not-so-long line of text     |
#+end_quote

And we press ~j~ we wan't the cursor to end up here:

#+begin_quote
1| Here's a normal line of text                  |
2| Some really loo<o>oooooong text that won't f- | <--- Edge of the window
.| it in the window and is therefore wrapped.    |
3| Here's another not-so-long line of text       |
#+end_quote

But by default we would move by "logical" lines and notes visual ones, ending up here:

#+begin_quote
1| Here's a normal line of text                |
2| Some really looooooooong text that won't f- | <--- Edge of the window
.| it in the window and is therefore wrapped.  |
3| Here's another <n>ot-so-long line of text   |
                   ^
                   + -- It _looks_ like we've moved down by two lines.
#+end_quote

The config for this looks like:

#+begin_src elisp :tangle ./doom-emacs/config.el
(add-hook 'org-mode-hook 'visual-line-mode)

(after! org
  (define-key evil-normal-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
  (define-key evil-motion-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
  (define-key evil-motion-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
  (define-key evil-normal-state-map (kbd "<remap> <evil-backward-char>") 'left-char)
  (define-key evil-motion-state-map (kbd "<remap> <evil-forward-char>") 'right-char)
  (define-key evil-normal-state-map (kbd "<remap> <evil-backward-char>") 'left-char)
  (define-key evil-motion-state-map (kbd "<remap> <evil-forward-char>") 'right-char)
)
#+end_src

**** TODO [#C] Remove wierd ~after! org~ and ~(add-hook 'org-mode-hook ...)~ call
Is it necesary? Was it added because the rebinds would get overriden otherwise? If so there should be a more suitable hook than ~org~ for this, it's kinda confusing.

**** TODO [#C] When moving multiple lines (ex. ~11j~); move by logical lines
When displaying relative line numbers they are displayed following logical lines, and when we're moving multipel lines at once the relative line numbers are what we're looking at, therefore moving multie lines should be interpreted as moving by logical lines
*** Relative line numbering
#+begin_src elisp tangle: ./doom-emacs/config.el
(setq display-line-numbers-type 'relative)
#+end_src

*** Insert emojis and unicode
:PROPERTIES:
:ID:       88c7c91a-e4d1-4130-8556-68418df4e65b
:END:
We enable emojify in ~init.el~ by adding the ~(emoji +unicode)~ snippet.

If we would like to render ascii or github-style emojis (like :smile) we'd add ~+ascii~ and ~+github~ respectively.

By default emojis are rendered as images, but our font has good unicode support so we'd like to display unicode glyphs as is:

#+begin_src elisp :tangle ./doom-emacs/config.el
(setq emojify-display-style 'unicode)
#+end_src

#+RESULTS:
: unicode

*** Custom unicode/emoji insertion
We use =emojify= (see [[*Insert emojis][Insert emojis]]) to insert emoji, we can also use this to easilly insert any kind of unicode characters we may want:

#+begin_src elisp :tangle ./doom-emacs/config.el
(setq emojify-user-emojis '(("—" . (("name" . "Em Dash")
                                    ("unicode" . "—")
                                    ("style" . "unicode")))
                            ("⇔" . (("name" . "\\iff")
                                    ("unicode" . "⇔")
                                    ("style" . "unicode")))
                            ("⇒" . (("name" . "\\implies")
                                    ("unicode" . "⇒")
                                    ("style" . "unicode")))
                            ("∀" . (("name" . "\\forall")
                                    ("unicode" . "∀")
                                    ("style" . "unicode")))
                            ("∃" . (("name" . "\\exists")
                                    ("unicode" . "∃")
                                    ("style" . "unicode")))
                            ("■" . (("name" . "\\qed")
                                    ("unicode" . "■")
                                    ("style" . "unicode")))
                            ("≅" . (("name" . "\\cong")
                                    ("unicode" . "≅")
                                    ("style" . "unicode")))
                            ("≤" . (("name" . "\\leq")
                                    ("unicode" . "≤")
                                    ("style" . "unicode")))
                            ))

;; If emojify is already loaded refresh emoji data
(when (featurep 'emojify)
  (emojify-set-emoji-data))
#+end_src
#+RESULTS:

See https://github.com/iqbalansari/emacs-emojify#custom-emojis for further reading.

*** Spell checking (Not active, wasn't configured successfully)
This hasn't been configured successfully, the broken config that might be useful for a future atempt looks like this:

~config.el~
#+begin_src elisp
(with-eval-after-load "ispell"
  ;; Configure 'LANG', otherwise 'ispell.el' cannot find a 'default
  ;; dictionary' even though multiple dictionaries will be configured
  ;; in next line.
  (setenv "LANG" "en_US.UTF-8")
  (setq ispell-program-name "hunspell")

  (setq ispell-dictionary "en_US,sv_SE")

  ;; 'ispell-set-spellchecker-params' has to be called
  ;; before 'ispell-hunspell-add-multi-dic' will work
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "en_US,sv_SE")

  ;; For saving words to the personal dictionary, don't infer it from
  ;; the locale, otherwise it would save to ~/.hunspell_de_DE.
  (setq ispell-personal-dictionary "~/.hunspell_personal_dictionary"))

  ;; The personal dictionary file has to exist, otherwise hunspell will
  ;; silently not use it.
  (unless (file-exists-p ispell-personal-dictionary)
    (write-region "" nil ispell-personal-dictionary nil 0))
#+end_src

#+begin_src nix
{
  let
    hunspell = hunspellWithDicts ( with hunspellDicts; [ sv-se  en-us ] );
  in
  extraConfig = ''
    (setq exec-path (append exec-path '("${hunspell}/bin")))
  '';
}
#+end_src
*** General =org-mode=
**** TODO-Keywords
We define the following keywords:

#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "PROJ(p)" "WATCH(w)" "HOLD(h)" "BACKLOG(b)" "|" "DONE(d)" "KILL(k)")
          (sequence "MEET(m)" "|" "MEET_(_)")
          (sequence "MAYBE/SOMEDAY(s)" "|" "ABANDONED(a)"))))
#+end_src

With the following colors:

#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org
  (setq org-todo-keyword-faces
        '(("TODO" . "medium sea green")
          ("PROJ" . "dark cyan")
          ("WATCH" . "khaki")
          ("HOLD" . "coral")
          ("BACKLOG" . "yellow green")
          ("MEET" . "light sea green")
          ("MAYBE/SOMEDAY" . "pale goldenrod"))))
#+end_src

We can run  ~M-x list-colors-display~ to see a list of available color names.

