doom-emacs/config.el
(add-hook 'org-mode-hook 'visual-line-mode)

(after! org
  (define-key evil-normal-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
  (define-key evil-motion-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
  (define-key evil-motion-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
  (define-key evil-normal-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
  (define-key evil-normal-state-map (kbd "<remap> <evil-backward-char>") 'left-char)
  (define-key evil-motion-state-map (kbd "<remap> <evil-forward-char>") 'right-char)
  (define-key evil-normal-state-map (kbd "<remap> <evil-backward-char>") 'left-char)
  (define-key evil-motion-state-map (kbd "<remap> <evil-forward-char>") 'right-char)
)

(setq emojify-display-style 'unicode)

(setq emojify-user-emojis '(("—" . (("name" . "Em Dash")
                                    ("unicode" . "—")
                                    ("style" . "unicode")))
                            ("⇔" . (("name" . "\\iff")
                                    ("unicode" . "⇔")
                                    ("style" . "unicode")))
                            ("⇒" . (("name" . "\\implies")
                                    ("unicode" . "⇒")
                                    ("style" . "unicode")))
                            ("∀" . (("name" . "\\forall")
                                    ("unicode" . "∀")
                                    ("style" . "unicode")))
                            ("∃" . (("name" . "\\exists")
                                    ("unicode" . "∃")
                                    ("style" . "unicode")))
                            ("■" . (("name" . "\\qed")
                                    ("unicode" . "■")
                                    ("style" . "unicode")))
                            ("≅" . (("name" . "\\cong")
                                    ("unicode" . "≅")
                                    ("style" . "unicode")))
                            ("≤" . (("name" . "\\leq")
                                    ("unicode" . "≤")
                                    ("style" . "unicode")))
                            ))

;; If emojify is already loaded refresh emoji data
(when (featurep 'emojify)
  (emojify-set-emoji-data))

(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "PROJ(p)" "WATCH(w)" "HOLD(h)" "BACKLOG(b)" "|" "DONE(d)" "KILL(k)")
          (sequence "MEET(m)" "|" "MEET_(_)")
          (sequence "MAYBE/SOMEDAY(s)" "|" "ABANDONED(a)"))))

(after! org
  (setq org-todo-keyword-faces
        '(("TODO" . "medium sea green")
          ("PROJ" . "dark cyan")
          ("WATCH" . "khaki")
          ("HOLD" . "coral")
          ("BACKLOG" . "yellow green")
          ("MEET" . "light sea green")
          ("MAYBE/SOMEDAY" . "pale goldenrod"))))
