README.org
**** Font faces

When making ~*bold*~, ~/italic/~, etc we don't want to show the actual markers:

#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org (setq org-hide-emphasis-markers t))
#+end_src

We wan't most of out non-code text to be /variable-pitch/ a.k.a. non-monospace. We enable variable-pitch:

#+begin_src elisp :tangle ./doom-emacs/config.el
(add-hook 'org-mode-hook 'variable-pitch-mode)
#+end_src

Now we setup the font faces: (If you're in a org document and want to know the face a character; put you cursor over it and type ~SPC h '~, then go to the bottom of the buffer and look for a =face= entry.

#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org
  (custom-theme-set-faces 'user
                          '(org-level-1 ((t (:foreground "gray" :height 1.3 :weight bold))))
                          '(org-level-2 ((t (:foreground "gray" :height 1.075 :weight bold))))
                          '(org-level-3 ((t (:foreground "gray" :height 1.075 :weight bold))))
                          '(org-level-4 ((t (:foreground "gray" :height 1.075 :weight bold))))
                          '(org-level-5 ((t (:foreground "gray" :height 1.075 :weight bold))))
                          '(org-level-6 ((t (:foreground "gray" :height 1.075 :weight bold))))
                          '(org-level-7 ((t (:foreground "gray" :height 1.075 :weight bold))))
                          '(org-level-8 ((t (:foreground "gray" :height 1.075 :weight bold))))
                          '(org-block ((t (:inherit (shadow fixed-pitch)))))
                          '(org-code ((t (:inherit (shadow fixed-pitch)))))
                          '(org-document-info ((t (:foreground "dark orange"))))
                          '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
                          '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
                          '(org-link ((t (:foreground "royal blue" :underline t))))
                          '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
                          '(org-property-value ((t (:inherit fixed-pitch))) t)
                          '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
                          '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
                          '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
                          '(org-verbatim ((t (:inherit (shadow fixed-pitch)))))
                          '(line-number ((t (:inherit fixed-pitch :foreground "#3f444a"))))
                          '(line-number-current-line ((t (:inherit fixed-pitch :foreground "#bbc2cf"))))
                          ))
#+end_src

**** Which programs to use for opening org links

#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org
  (setq org-file-apps
        '((auto-mode . emacs)
          ("\\.mm\\'" . default)
          ("\\.x?html?\\'" . default)
          ("\\.pdf\\'" . "firefox %s"))))
#+end_src

**** TODO Configure org link opening behaviour in the respective program section

For example opening web pages and pdf's with firefox should be configured in a firefox section.

*** Zettelkasten-method with =org-roam v2=.
We install this by manually adding the ~+roam2~ flag to the ~org~ module in ~init.el~.

**** roam graph with =graphviz=
org-roam uses /graphviz/ to generate a graph from all of the notes. We install the program and make sure that emacs can find the binary:

#+name: users-emma-emacs-zettelkasten
#+begin_src nix
{
  programs.doom-emacs.extraPackages = [ pkgs.graphviz ];
}
#+end_src

#+name: users-emma-emacs-extra-config-zettelkasten
#+begin_src elisp
(setq org-roam-graph-executable "${pkgs.graphviz.out}/bin/dot")
#+end_src

**** =org-roam-ui=
From https://github.com/org-roam/org-roam-ui#doom
#+begin_quote
Org-roam-ui tries to keep up with the latest features of org-roam, which conflicts with Doom Emacs's desire for stability. To make sure nothing breaks, use the latest version of org-roam by unpinning it.
#+end_quote

#+begin_src elisp :tangle ./doom-emacs/packages.el
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

#+begin_src elisp :tangle ./doom-emacs/config.el
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

**** Custom capture templates
Capture templates can be used when creating new nodes with org-roam. I've used [[https://systemcrafters.net/build-a-second-brain-in-emacs/capturing-notes-efficiently/][this blogpost]] to guide me through the process.

***** Default template
#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org-roam
  (setq my-org-roam-capture-tempalte-default
        '("d" "default" plain
        "%?"
        :target (file+head "%<%y%m%d%h%m%s>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)))
#+end_src

***** Book note template
#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org-roam
  (setq my-org-roam-capture-template-book-note
        '("b" "book note" plain
        "\n*Child of:* [[id:33cdaa07-757a-491d-af0c-a25cbc9b7231][📚 Notes from reading books]]\n\n*Date read:*\n*ISBN:* \n*Source URI:* \n\n%?"
        :target (file+head "%<%y%m%d%h%m%s>-${slug}.org" "#+title: 📚 ${title}\n")
        :unnarrowed t)))
#+end_src

***** Setting the =org-roam-capture-templates= variable
#+begin_src elisp :tangle ./doom-emacs/config.el
(after! org-roam
  (setq org-roam-capture-templates
        (list my-org-roam-capture-tempalte-default
              my-org-roam-capture-template-book-note)))
#+end_src

*** Read pdf's and epub's with =pdftools=, =nov.el= and anotate them with =noter=
=noter= allows us to annotate our documents and =nov.el= displays epubs in emacs, these two go very well together!

We added ~+noter~ flag to the ~org~ module in ~doom-emacs/init.el~
[[https://github.com/weirdNox/org-noter][Documentation for noter]]

We add the ~pdf~ module in ~doom-emacs/init.el~ to get =pdftools=

We install =nov.el= via ~packages.el~:

#+begin_src elisp :tangle ./doom-emacs/packages.el
(package! nov)
#+end_src

=nov.el= uses ~unzip~ when reading epubs, let's make sure that's availible
[[https://depp.brause.cc/nov.el/][Documentation for nov.el]]

#+name: users-emma-emacs-nov-el
#+begin_src nix
{
  programs.doom-emacs.extraPackages = [ pkgs.unzip ];
}
#+end_src

#+name: users-emma-emacs-extra-config-nov-el
#+begin_src elisp
(setq nov-unzip-program "${pkgs.unzip.out}/bin/unzip")
#+end_src

Now we make sure to activate ~nov-mode~ on reading ~.epub~

#+begin_src elisp :tangle ./doom-emacs/config.el
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
#+end_src

*** Terminal emulator
We're using ~shell~ (see ~init.el~) for our terminal needs.

We bind ~C-c t~ to launching a new terminal with ~term_~.

The ~term_~ function is based off of ~term~ but with two changes:
1) In interactive mode we don't prompt for the shell program to run, we just run bash
2) Each ~term_~ invocation creates a new terminal buffer, the behaviour is ~term~ is to create a single buffer or switch to it if it exists.

#+begin_src elisp :tangle ./doom-emacs/config.el
(defvar nterms 0)

(defun term_ (program)
  "Modified version of ~term~"
  (interactive (list "/run/current-system/sw/bin/bash"))
  (setq nterms (+ 1 nterms))
  (let ((termname (concat "terminal-" (number-to-string nterms))))
      (set-buffer (make-term termname program))
      (term-mode)
      (term-char-mode)
      (switch-to-buffer (concat "*" termname "*"))))

(define-key (current-global-map) (kbd "C-c t") #'term_)
#+end_src

*** Python language server
We've added ~(python +lsp +pyright)~ to ~./doom-emacs/init.el~.

We also install pyright to the user environment

#+name: users-emma-emacs-python
#+begin_src nix
{
  home.packages = [ pkgs.nodePackages.pyright ];
}
#+end_src

**** TODO Can pyright be installed so that only emacs can see it? Only emacs uses it

** direnv
#+name: users-emma-direnv
#+begin_src nix
{
  home.packages = [ pkgs.direnv ];
}
#+end_src

We add a direnv hook to bash

#+name: users-emma-direnv-bashrc-extra
#+begin_src shell
eval "$(${pkgs.direnv}/bin/direnv hook bash)"
#+end_src

*** TODO Move emacs for direnv config here
** Misc programs specific to emma
*** firefox
#+name: users-emma-firefox
#+begin_src nix
(
let
  firefox = pkgs.firefox;
in
{
  home.packages = [ firefox ];
  home.file."bin/firefox" = applicationScript "${firefox}/bin/firefox $@";
}
)
#+end_src
*** Gimp
#+name: users-emma-gimp
#+begin_src nix
{
  home.packages = [ pkgs.gimp ];
}
#+end_src
*** Feh
#+name: users-emma-feh
#+begin_src nix
{
  home.packages = [ pkgs.feh ];
}
#+end_src

*** Tldr
Tealdr is a rust implementation of tldr
#+name: users-emma-tldr
#+begin_src nix
{
  home.packages = [ pkgs.tealdeer ];
}
#+end_src

*** zip and unzip
#+name: users-emma-zip-unzip
#+begin_src nix
{
  home.packages = [ pkgs.zip pkgs.unzip ];
}
#+end_src
*** spectre-cli
We use spectre-cli as a password manager

#+name: users-emma-spectre-cli
#+begin_src nix
{
  home.packages = [ pkgs.spectre-cli ];
  home.shellAliases = {
    spectre = ''SPECTRE_USERNAME="emmabastas" ${pkgs.spectre-cli}/bin/spectre -q'';
    spectre_ = ''${pkgs.spectre-cli}/bin/spectre -q'';
  };
}
#+end_src
*** customized vim
The system-installed vim is boring, let's add our own

#+name: users-emma-vim
#+begin_src nix
{
  home.packages = [ (pkgs.callPackage ./vim-cli.nix {}) ];
}
#+end_src
** Globally installed programming language
Some languages we find ourselves using quite a lot for simple scripting and we want to install them globally to save ourselves from a bunch of ~shell.nix~'s all over the place.

#+name: users-emma-global-pls
#+begin_src nix
{
  home.packages = [
    pkgs.ghc
    pkgs.haskell-language-server
  ];
}
#+end_src

In addition to this we add the ~python~ and ~haskell~ module to ~init.el~

** Flashcards setup
*** =org-drill=
We install org-drill via ~packages.el~:

#+begin_src elisp :tangle ./doom-emacs/packages.el
(package! org-drill)
#+end_src

In my workflow I tend to add flashcards in batches, this also means that flashcards to review will tend to comme in batches as well. To deal with this we add /noise/ to the scheduling, causing the review dates to /spread out/. This is a common technique and org-drill has a setting for enabling this feature:

#+begin_src elisp :tangle ./doom-emacs/config.el
(setq org-drill-add-random-noise-to-intervals-p t)
#+end_src

By default org-drill prompts us to save the file when done with the drill session. Saving is in my muscle-memory and I only find this anoying so let's dissable it:

#+begin_src elisp :tangle ./doom-emacs/config.el
(setq org-drill-save-buffers-after-drill-sessions-p nil)
#+end_src

I don't want the card headings to show as they ca reveal information.

#+begin_src elisp :tangle ./doom-emacs/config.el
(setq org-drill-hide-item-headings-p t)
#+end_src

*** =webwork-flashcard=
I've made a custom webserver for integrating webwork problems with my flashcard setup. Read more about it here: https://github.com/emmabastas/webwork-flashcard

#+name: users-emma-webwork-flashcard
#+begin_src nix
{
  home.packages = [ (pkgs.callPackage ./webwork-flashcard {}) ];
}
#+end_src
